In [2]:
import pandas as pd

In [4]:
df1 = pd.read_csv("Book_Data.csv")
df2 = pd.read_csv("data.csv")

In [10]:
df1.head(2)

,Unnamed: 0,title,book_link,img_link,rating,price,availability
0,0,A Light in the Attic,https://books.toscrape.com/catalogue/a-light-i...,https://books.toscrape.com/../media/cache/2c/d...,3,£51.77,True
1,1,Tipping the Velvet,https://books.toscrape.com/catalogue/tipping-t...,https://books.toscrape.com/../media/cache/26/0...,1,£53.74,True

In [12]:
df2.head(2)

,book category,UPC,price (exc tax),price (inc tax),tax,quantity,reviews
0,Poetry,a897fe39b1053632,£51.77,£51.77,£0.00,In stock (22 available),0
1,Historical Fiction,90fa61229261140a,£53.74,£53.74,£0.00,In stock (20 available),0

In [14]:
df = pd.DataFrame()

### Adding title

In [44]:
df["title"] = df1["title"]
df["category"] = df2["book category"]
df["price (exc tax)"] = df2["price (exc tax)"]
df["price (inc tax)"] = df2["price (inc tax)"]
df["tax"] = df2["tax"]
df["rating"] = df1["rating"]
df["reviews"] = df2["reviews"]
df["UPC"] = df2["UPC"]
df["quantity"] = df2["quantity"]
df["availability"] = df1["availability"]
df["book link"] = df1["book_link"]
df["image link"] = df1["img_link"]

In [48]:
df.head(2)

,title,category,price (exc tax),price (inc tax),tax,rating,reviews,UPC,quantity,availability,book link,image link
0,A Light in the Attic,Poetry,£51.77,£51.77,£0.00,3,0,a897fe39b1053632,In stock (22 available),True,https://books.toscrape.com/catalogue/a-light-i...,https://books.toscrape.com/../media/cache/2c/d...
1,Tipping the Velvet,Historical Fiction,£53.74,£53.74,£0.00,1,0,90fa61229261140a,In stock (20 available),True,https://books.toscrape.com/catalogue/tipping-t...,https://books.toscrape.com/../media/cache/26/0...

In [50]:
df.isnull().sum()

title              0
category           0
price (exc tax)    0
price (inc tax)    0
tax                0
rating             0
reviews            0
UPC                0
quantity           0
availability       0
book link          0
image link         0
dtype: int64

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   title            1000 non-null   object
 1   category         1000 non-null   object
 2   price (exc tax)  1000 non-null   object
 3   price (inc tax)  1000 non-null   object
 4   tax              1000 non-null   object
 5   rating           1000 non-null   int64
 6   reviews          1000 non-null   int64
 7   UPC              1000 non-null   object
 8   quantity         1000 non-null   object
 9   availability     1000 non-null   bool
 10  book link        1000 non-null   object
 11  image link       1000 non-null   object
dtypes: bool(1), int64(2), object(9)
memory usage: 87.0+ KB

In [56]:
df.to_csv("Books.csv")